tap "heroku/brew"
tap "hhvm/hhvm"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "romkatv/powerlevel10k"
# TIFF library and utilities
brew "libtiff"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# C/C++/ObjC language server
brew "ccls"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods", link: false
# Reimplementation of ctags(1)
brew "ctags"
# General purpose Language Server
brew "efm-langserver"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Language server for the Go language
brew "gopls"
# Tools and libraries to manipulate images in many formats
brew "imagemagick@6"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Next-gen compiler infrastructure
brew "llvm"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Small build system for use with gyp or CMake
brew "ninja"
# Object-relational database system
brew "postgresql", restart_service: true
# Object-relational database system
brew "postgresql@12"
# Object-relational database system
brew "postgresql@13"
# Tool Command Language
brew "tcl-tk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# JIT compiler and runtime for the Hack language
brew "hhvm/hhvm/hhvm-4.111"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# Keyboard customizer
cask "karabiner-elements"
